; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-7nodes-1000size-3degree-100mindistance-4trucks-2packages-798seed

(define (problem transport-two-cities-sequential-7nodes-1000size-3degree-100mindistance-4trucks-2packages-798seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  city-1-loc-6 - location
  city-2-loc-6 - location
  city-1-loc-7 - location
  city-2-loc-7 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  package-1 - package
  package-2 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 45,368 -> 34,548
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 18)
  ; 34,548 -> 45,368
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 18)
  ; 229,553 -> 34,548
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 20)
  ; 34,548 -> 229,553
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 20)
  ; 229,553 -> 45,368
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 27)
  ; 45,368 -> 229,553
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 27)
  ; 602,505 -> 229,553
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 38)
  ; 229,553 -> 602,505
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 38)
  ; 315,215 -> 34,548
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 44)
  ; 34,548 -> 315,215
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 44)
  ; 315,215 -> 45,368
  (road city-1-loc-5 city-1-loc-2)
  (= (road-length city-1-loc-5 city-1-loc-2) 31)
  ; 45,368 -> 315,215
  (road city-1-loc-2 city-1-loc-5)
  (= (road-length city-1-loc-2 city-1-loc-5) 31)
  ; 315,215 -> 229,553
  (road city-1-loc-5 city-1-loc-3)
  (= (road-length city-1-loc-5 city-1-loc-3) 35)
  ; 229,553 -> 315,215
  (road city-1-loc-3 city-1-loc-5)
  (= (road-length city-1-loc-3 city-1-loc-5) 35)
  ; 315,215 -> 602,505
  (road city-1-loc-5 city-1-loc-4)
  (= (road-length city-1-loc-5 city-1-loc-4) 41)
  ; 602,505 -> 315,215
  (road city-1-loc-4 city-1-loc-5)
  (= (road-length city-1-loc-4 city-1-loc-5) 41)
  ; 297,98 -> 45,368
  (road city-1-loc-6 city-1-loc-2)
  (= (road-length city-1-loc-6 city-1-loc-2) 37)
  ; 45,368 -> 297,98
  (road city-1-loc-2 city-1-loc-6)
  (= (road-length city-1-loc-2 city-1-loc-6) 37)
  ; 297,98 -> 315,215
  (road city-1-loc-6 city-1-loc-5)
  (= (road-length city-1-loc-6 city-1-loc-5) 12)
  ; 315,215 -> 297,98
  (road city-1-loc-5 city-1-loc-6)
  (= (road-length city-1-loc-5 city-1-loc-6) 12)
  ; 899,173 -> 602,505
  (road city-1-loc-7 city-1-loc-4)
  (= (road-length city-1-loc-7 city-1-loc-4) 45)
  ; 602,505 -> 899,173
  (road city-1-loc-4 city-1-loc-7)
  (= (road-length city-1-loc-4 city-1-loc-7) 45)
  ; 2706,200 -> 2667,546
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 35)
  ; 2667,546 -> 2706,200
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 35)
  ; 2951,531 -> 2667,546
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 29)
  ; 2667,546 -> 2951,531
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 29)
  ; 2951,531 -> 2706,200
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 42)
  ; 2706,200 -> 2951,531
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 42)
  ; 2499,850 -> 2667,546
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 35)
  ; 2667,546 -> 2499,850
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 35)
  ; 2115,786 -> 2229,371
  (road city-2-loc-6 city-2-loc-1)
  (= (road-length city-2-loc-6 city-2-loc-1) 43)
  ; 2229,371 -> 2115,786
  (road city-2-loc-1 city-2-loc-6)
  (= (road-length city-2-loc-1 city-2-loc-6) 43)
  ; 2115,786 -> 2499,850
  (road city-2-loc-6 city-2-loc-5)
  (= (road-length city-2-loc-6 city-2-loc-5) 39)
  ; 2499,850 -> 2115,786
  (road city-2-loc-5 city-2-loc-6)
  (= (road-length city-2-loc-5 city-2-loc-6) 39)
  ; 2343,896 -> 2499,850
  (road city-2-loc-7 city-2-loc-5)
  (= (road-length city-2-loc-7 city-2-loc-5) 17)
  ; 2499,850 -> 2343,896
  (road city-2-loc-5 city-2-loc-7)
  (= (road-length city-2-loc-5 city-2-loc-7) 17)
  ; 2343,896 -> 2115,786
  (road city-2-loc-7 city-2-loc-6)
  (= (road-length city-2-loc-7 city-2-loc-6) 26)
  ; 2115,786 -> 2343,896
  (road city-2-loc-6 city-2-loc-7)
  (= (road-length city-2-loc-6 city-2-loc-7) 26)
  ; 899,173 <-> 2229,371
  (road city-1-loc-7 city-2-loc-1)
  (= (road-length city-1-loc-7 city-2-loc-1) 135)
  (road city-2-loc-1 city-1-loc-7)
  (= (road-length city-2-loc-1 city-1-loc-7) 135)
  (at package-1 city-1-loc-7)
  (at package-2 city-1-loc-2)
  (at truck-1 city-2-loc-6)
  (capacity truck-1 capacity-3)
  (at truck-2 city-2-loc-7)
  (capacity truck-2 capacity-4)
  (at truck-3 city-2-loc-1)
  (capacity truck-3 capacity-4)
  (at truck-4 city-2-loc-2)
  (capacity truck-4 capacity-2)
 )
 (:goal (and
  (at package-1 city-2-loc-4)
  (at package-2 city-2-loc-4)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-3 city-2-loc-1 city-1-loc-7)
   deleted: (at truck-3 city-2-loc-1)
   added: (at truck-3 city-1-loc-7)
   goals met: 0 of 2
2. (pick-up truck-3 city-1-loc-7 package-1 capacity-3 capacity-4)
   deleted: (at package-1 city-1-loc-7) (capacity truck-3 capacity-4)
   added: (in package-1 truck-3) (capacity truck-3 capacity-3)
   goals met: 0 of 2
3. (drive truck-3 city-1-loc-7 city-1-loc-4)
   deleted: (at truck-3 city-1-loc-7)
   added: (at truck-3 city-1-loc-4)
   goals met: 0 of 2
4. (drive truck-3 city-1-loc-4 city-1-loc-3)
   deleted: (at truck-3 city-1-loc-4)
   added: (at truck-3 city-1-loc-3)
   goals met: 0 of 2
5. (drive truck-3 city-1-loc-3 city-1-loc-2)
   deleted: (at truck-3 city-1-loc-3)
   added: (at truck-3 city-1-loc-2)
   goals met: 0 of 2
6. (pick-up truck-3 city-1-loc-2 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-1-loc-2) (capacity truck-3 capacity-3)
   added: (in package-2 truck-3) (capacity truck-3 capacity-2)
   goals met: 0 of 2
7. (drive truck-3 city-1-loc-2 city-1-loc-3)
   deleted: (at truck-3 city-1-loc-2)
   added: (at truck-3 city-1-loc-3)
   goals met: 0 of 2
8. (drive truck-3 city-1-loc-3 city-1-loc-4)
   deleted: (at truck-3 city-1-loc-3)
   added: (at truck-3 city-1-loc-4)
   goals met: 0 of 2
9. (drive truck-3 city-1-loc-4 city-1-loc-7)
   deleted: (at truck-3 city-1-loc-4)
   added: (at truck-3 city-1-loc-7)
   goals met: 0 of 2
10. (drive truck-3 city-1-loc-7 city-2-loc-1)
   deleted: (at truck-3 city-1-loc-7)
   added: (at truck-3 city-2-loc-1)
   goals met: 0 of 2
11. (drive truck-3 city-2-loc-1 city-2-loc-6)
   deleted: (at truck-3 city-2-loc-1)
   added: (at truck-3 city-2-loc-6)
   goals met: 0 of 2
12. (drive truck-3 city-2-loc-6 city-2-loc-5)
   deleted: (at truck-3 city-2-loc-6)
   added: (at truck-3 city-2-loc-5)
   goals met: 0 of 2
13. (drive truck-3 city-2-loc-5 city-2-loc-2)
   deleted: (at truck-3 city-2-loc-5)
   added: (at truck-3 city-2-loc-2)
   goals met: 0 of 2
14. (drive truck-3 city-2-loc-2 city-2-loc-4)
   deleted: (at truck-3 city-2-loc-2)
   added: (at truck-3 city-2-loc-4)
   goals met: 0 of 2
15. (drop truck-3 city-2-loc-4 package-1 capacity-2 capacity-3)
   deleted: (in package-1 truck-3) (capacity truck-3 capacity-2)
   added: (at package-1 city-2-loc-4) (capacity truck-3 capacity-3)
   goals met: 1 of 2
16. (drop truck-3 city-2-loc-4 package-2 capacity-3 capacity-4)
   deleted: (in package-2 truck-3) (capacity truck-3 capacity-3)
   added: (at package-2 city-2-loc-4) (capacity truck-3 capacity-4)
   goals met: 2 of 2
